The alarm noisily blared its call out into the morose tenement, impatient as always. It was 4:00 AM and Callum Rowe had been laying awake in his worn bed, gloomily gazing up at the flaking ceiling. As the alarm rang, he sighed, reached across, and tapped the plastic snooze button. With a squeaky click, silence once again filled the room. It was time already. He rolled up into a sitting position and rubbed the back of his aching neck. With a groan, he stood up and walked over to the far wall, the old carpet did as terrible a job of masking the creaking of the cold floorboards as his t-shirt did of masking the creaking of his back. Nailed to that wall was a stained calendar filled with adverts for oil changes and discounted auto checkups. He had gotten it from his neighbor, Gary, who worked at the auto-repair shop down by the train station. The day's date had been circled vigorously. He silently stared at the circle as the dread of what was to come pooled in his limbs and made them heavier. A few moments passed, and he sighed again, wishing today was just another of his nightmares. He knew it wasn't. This was worse than any nightmare. “Well, let's get to it” he muttered to himself. He went off to the little corner bathroom of the apartment and brushed his teeth in front of the toilet, standing on yellowing tiles. The little sink was on top of the toilet and the tub was crammed next to both the toilet and the sink. He then stepped into that grimy tub and turned on the water for a shower. It was cold and getting colder. It looked like the water heating system had failed again. What Callum didn't know was that it had never been fixed. He assumed it broke every day, as the landlord would claim he had fixed it the day before. After the cold shower, he went to get dressed. The clean old suit he pulled on had seen better days and only had a few more occasions left as it was coming apart at the seams. It looked about as tired as he felt. He looked over to the fridge and thought of making something to eat, but his stomach was bloated. There was a mirror on the wall next to his bed and he stood in front of it. He stared at himself. The short-cropped black hair was peppered with gray. The dark rings under his bloodshot golden eyes made him look sick. His tan skin looked ashen in the overcast early morning light, which strangely had a green cast to it. Staring intently into the mirror, he suddenly burst into a wide smile, his chapped lips tearing. “Hey, Oira! How've you been?”. His reflection stared back at him, not responding. The smile slowly faded. He wiped the small drop of blood forming on his lips with his thumb. He tried again, this time with a calmer tone, “Hey, Oira. Had a good time?” His smile turned to a scowl and he glared at his reflection, which glared right back. Callum didn't smile this time. “Hey Oira. Nice seeing you.” he said, then let out a deep breath. He kept trying different poses, sometimes puffing out his chest and other times folding his arms. He tried speaking in different tones. Nothing seemed natural. He finally gave up as he looked back at the clock. 5:45 AM. Had he stood there for that long? Well, it was time to go see Oira. Callum pulled on his old pair of black polished dress shoes and strode out of the apartment, into the musty hallway that smelled of mold. Quickly down the staircase, he went to the ground floor 3 levels below. Opening the tenement door, he was blasted by the smog-filled chilly morning air. A gust of wind ripped through the narrow side street that he called home, carrying with it the scent of burnt wood and gasoline. Callum pulled his suit coat tightly around him as he jogged to the bus stop a block down, on the corner of 1st Street and his unnamed side street. As he jogged past rundown shops with tenement apartments stacked precariously atop them, he looked up to the sky, watching the heavy cloud cover roil with a green tinge, and his worry grew. The mages in their towers were up to something again. At the bus stop, about a dozen men and women waited in their work uniforms: old overalls, in suits that had seen better days like his, and then the men in reinforced kevlar armor who waited to go to their security posts. They all nodded as he approached, and he nodded back. After a few moments in the rare early morning silence, the bus pulled up, hissing, popping, and creaking to a stop, the faded advertisements glued on its side reminding everyone to “only buy the best toothpaste” or to “get the only ice cream in town with real synthetic milk!” and some other such advice. They all filed in and sat down in the seats, whose upholstery patterns were worse than the stains that worked heroically to hide them. Approximately 40 minutes later, the bus trundled into the stop at the entrance of Old Hillway Train Station on the outskirts of the city. It consisted of a wooden kiosk that sold tickets and overpriced newspapers, a small parking lot off to the side which remained empty save for the taxis that waited for potential travelers, and a set of cracked orange brick steps that led to a large cement block which served as a platform for the train's soon-to-be and previous passengers. Callum looked back across the street to the auto repair shop where Gary had gotten him the calendar. He could hear the power tools humming, thumping, and blasting as the various car mechanics worked away. Gary was already there. Callum could see his rusted-out car parked in front of the shop. Maybe he hadn't even gone home? Gary was a strange one for sure. He turned to the train station and walked over to the kiosk. “A ticket for Crown.” Callum muttered. “Crown eh? Going to see some fancy noble?” the teller laughed. He had thinning gray hair and a bushy white beard that covered his gaunt face and partially covered the grimy name-tag he had pinned to his faded tweed jacket. It read ‘Hi, my name is Paul'. Callum didn't laugh. Instead, he glared and slid a copper coin over to Paul, along with his Identification card, which was pulled from his coat pocket where he always kept it. The teller took the hint and with a deep frown, he snatched up his ID and scanned it against the bronze ticket dispenser's sensor module, a bulky block of plastic that was attached to its side. He punched a few keys on the keypad at the top of the ticket dispenser. The machine whirred and buzzed then spat out a small white ticket with a barcode printed on both sides. Paul quickly handed over the ticket and the Identification card back to Callum and looked away with a huff. 15 minutes later, Callum stood alone on the platform, staring blankly at the faded logo painted on the surface, trying to determine if it was a humanoid duck or humanoid dog that was attempting to sell him the latest formula for synthetic ground coffee. As he pondered the dilemma, the platform began to tremble, and a shrill drawn-out horn could be heard wailing in the distance. Looking up to the east, he could see the dark steel engine of the train on the horizon, as well as the churning black smoke that spewed from it contrasting with the jade clouds that stretched over the sky like a sickly canvas. Soon enough it squealed to a stop. The first three carts of the train were passenger coaches and the rest were cargo pods, destined for the train depot. The first was gilded with gaudy floral designs engraved with fools gold into the steel. First-class. The second coach was painted magenta and had no obvious signs of wear. Business-class. The last few were bare rusted steel and were economy class. Each of them, however, had the same logo plastered across them with an identical script underneath: “The Silver Express: The only secure way to travel!”. The train's officers stood at each doorway with their rifles drawn. People began to leak from the train, first having their tickets checked for proper departure credentials, and then ensuring that they only left with the luggage they had boarded with. Each ticket was carefully scrutinized with silent intensity and a few passengers were pulled aside and ordered to wait. He waited for the boarding signal to ‘ding' before heading to economy class and handing over his ticket. The officer took the ticket and fed it to a small decoder attached to the coach wall next to the door. It sucked the ticket in and quickly spat out another ticket. This one was larger. It had his name, age, employment, and boarding and departing locations. The officer snapped a crisp salute, “High master Rowe! I, travel officer Sydel, welcome you to the Silver Express. Has there been a mistake with your ticket? If so, we can have you moved to at least business class.” Callum looked at the tall, well-built officer. His thick mustache, which was twirled upwards at each end, bobbed with every word. His impeccable green uniform was done up to his jaw, with its bronze buttons shining in the green overcast light. Callum shook his head, “No officer Sydel. I am where I'm supposed to be.” Officer Sydel looked uncomfortable. “Sir, with due respect, someone of your rank… shouldn't be seated here.” Callum looked over the over-crowded benches of the coach that lined the aisle which ran down the middle. It had luggage spilling out from the overhead compartments, most of which were dangerously bent and threatening to drop their burden upon the weary passengers beneath. “Officer Sydel, I understand your concern. My financial situation does not allow me to enjoy the benefit of better treatment. I will not tolerate the insult of any further questioning.” Officer Sydel said no more and directed him to a narrow, flat metal bar between an elderly couple that Callum was supposed to pretend was a seat. He didn't complain. He sat down as the old man and woman shifted and leaned as best they could to make room. After he was seated, the old man leaned over to Callum and whispered, “It's a privilege to meet you Mr. Rowe. You honored us all with your sacrifice and your dedication.” The old woman nodded and patted his hand. Callum gave them both a tight smile and said nothing. His hands, though, gripped his knees like a vise. Callum did not want anyone reminding him what had happened. He did not need their empty words. Especially not today, as he continued the journey to his greatest regret.